Tekla Open API Reference for Tekla Structures 2025
PlacingDistanceAttributes Properties
The PlacingDistanceAttributes type exposes the following members.
Properties
Name | Description
MaximalDistance
 Gets or sets the maximal distance for placing.
MinimalDistance
 Gets or sets the minimal distance for placing.
SearchMargin
 Gets or sets the search marginal for placing.
Top
See Also
Reference
PlacingDistanceAttributes Class
Tekla.Structures.Drawing Namespace